;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! srcery-theme)
(package! ghub)
(package! org-notebook)
(package! spacemacs-theme)
(package! cargo)
(package! kaolin-themes)
;; Show beautiful parenthesis
(package! rainbow-delimiters)
;; Gentoo Ebuild Mode
(package! ebuild-mode)
